//                                                          기본 문법 요약

//                                                      코드 구조
// 여러 개의 구문은 세미콜론을 기준으로 구분할 수 있다.

// 줄 바꿈도 여러 개의 구문을 구분하는 데 사용되므로 아래 코드는 정상적으로 동작한다.

// 대부분은 문장의 끝에 세미콜론을 붙이는 걸 권장한다.

// 코드블록이나 코드 블록과 함께 구성되는 문법 끝엔 세미콜론을 붙이지 않아도 괜찮다.

//                                                      엄격 모드
// 모던 자바스크립트에서 지원하는 기능을 활성화 하려면 스크립트  맨 위에 'use strict'를 적어줘야 한다.

//                                                      변수
// 변수는 아래와 같은 키워드를 이용해 선언할 수 있다.
// let, const - 한 번 값을 할당하면 더는 값을 바꿀 수 없는 상수 정의, var - 과거에 쓰이던 키워드
